Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/education/third_level_education/colleges_and_qualifications/third_level_qualifications.html.txt.tmx
Source language: en
Languages: ro

source: Further and higher education qualifications
ro: Calificări de învăţământ postşcolar şi de studii superioare

source: Different bodies are entitled to award or validate qualifications in the further and higher education sectors
ro: În prezent, diverse organisme din Irlanda au dreptul să acorde sau să valideze calificările din sectoarele de învăţământ postşcolar şi de studii superioare

source: Further education and training is education and training between post-primary level and higher education
ro: Educaţia şi pregătirea postşcolară reprezintă educaţia şi pregătirea care au loc între învăţământul primar şi studiile superioare

source: Higher education and training is provided mainly in universities and colleges of technology or equivalent bodies
ro: Educaţia şi pregătirea superioară în Irlanda este asigurată în principal de universităţile şi Colegiile Tehnologice sau de organisme echivalente

source: • Universities:The State-supported universities all award their own degrees and other awards
ro: • Universităţi: Universităţile de stat existente acordă propriile lor diplome şi alte atestate

source: • Institutes of technology: The Dublin Institute of Technology also makes its own awards
ro: • Instituţiile tehnologice: Institutul Tehnologic din Dublin are de asemenea propriile sale premii

source: The other institutes of technology grant degrees, diplomas and certificates which are validated by Quality and Qualifications Ireland
ro: Celelalte instituţii tehnologice oferă note, diplome şi certificate care sunt validate de centrul de Calitate şi Calificări Irlanda

source: • Other colleges: The other State-supported colleges generally grant awards that are validated by Quality and Qualifications Ireland
ro: • Alte colegii: Celelalte colegii susţinute de stat oferă în general premii care sunt validate de centrul de Calitate şi Calificări Irlanda

source: • Private colleges: The private colleges make awards, some of which are validated by foreign universities and some of which are validated by Quality and Qualifications Ireland
ro: • Colegii private: Colegiile private oferă premii, unele dintre acestea sunt validate de către universităţile străine şi unele sunt validate de către central de Calitate şi Calificare Irlanda

source: Some of their awards are not validated by any outside body
ro: Unele din premii nu sunt validate de o organizaţie externă

source: Quality and Qualifications Ireland
ro: Centrul Calitate şi calificări Irlanda

source: Quality and Qualifications Ireland (QQI) was established on 6 November 2012 under the Qualifications and Quality Assurance (Education and Training) Act 2012
ro: Centrul Calitate şi Calificări Irlanda (QQI) a fost înfiinţat în data de 6 noiembrie 2012 în conformitate cu Legea din 2012 pentru Calificări şi Asigurarea Calităţii (Educaţie şi instruire)

source: It has taken over the functions of the following 4 bodies:
ro: A preluat funcţiile următoarelor 4 organizaţii:

source: • National Qualifications Authority of Ireland (NQAI)
ro: • Autoritatea naţională de calificare din Irlanda (NQAI)

source: • Further Education and Training Awards Council (FETAC)
ro: • Consiliul de Recunoaştere a Educaţiei şi a Formării Continue (FETAC)

source: • Higher Education and Training Awards Council (HETAC)
ro: • Consiliul de Recunoaştere a Educaţiei Superioare şi a Formării Continue (HETAC)

source: • Irish Universities Quality Board (IUQB)
ro: • Comitetul de Calitate al Universităţilor Irlandeze (IUQB)

source: The NQAI was, among other things, responsible for establishing and maintaining the National Framework of Qualifications, establishing procedures for the councils and deciding on procedures to be implemented by the education providers in relation to access, transfer and progression
ro: NQAI a fost, printre altele, responsabil pentru înfiinţarea şi menţinerea Cadrelor naţionale de calificări, , stabilind proceduri pentru consilii şi luând decizii cu privire la procedurile care trebuie să fie implementate de furnizorii de educaţie cu privire la acces, transfer şi progres

source: The Qualifications Recognition service at the NQAI included the recognition of foreign qualifications and the International Qualifications Database
ro: Serviciul de Recunoaştere a calificărilor de le NQAI incluse în Calificările Străine de Recunoaştere şi în Baza de date a Calificărilor Internaţionale

source: The two awarding bodies - the Further Education and Training Awards Council (FETAC) and the Higher Education and Training Awards Council (HETAC) - were the certification bodies for all of the education and training in the State other than that in primary and post-primary education and in the universities and the Dublin Institute of Technology
ro: Cele două consilii de recunoaştere - Consiliul de Recunoaştere a Educaţiei şi a Formării Continue (FETAC) şi Consiliul de Recunoaştere a Educaţiei Superioare şi a Formării Continue (HETAC) – au fost organismele de certificare pentru toate formele de educaţie şi instruire din Stat altele decât cele din învăţământul primar şi secundar şi universităţile şi Institutul Tehnologic din Dublin

source: HETAC could delegate authority to institutes of technology to make higher education and training awards
ro: HETAC poate delega autoritatea instituţiilor tehnolohice pentru a oferi premii în învăţământul superior şi instruire

source: There was a similar facility within FETAC
ro: Exista o facilitate similară în FETAC

source: The principal functions of FETAC and HETAC were:
ro: Principalele funcţii ale FETAC şi HETAC erau:

source: • The establishment of policies and criteria for the making of awards
ro: • Stabilirea politicilor şi a criteriilor pentru acordarea premiilor

source: • The validation of programmes in further or higher education and training
ro: • Validarea programelor în învăţământul superior şi instrucţia ulterioară

source: • The setting of standards of knowledge, skill or competence which must be acquired by learners, before an award may be made
ro: • Stabilirea standardelor de cunoaştere, abilităţile şi competenţele ce trebuie să fie obţinute de elevi, înainte de a primi un premiu

source: Awards and qualifications formerly made by FETAC and HETAC continue to be recognised, because they are on the National Framework of Qualifications
ro: Premiile şi calificările oferite înainte de FETAC şi HETAC continuă să fie recunoscute, pentru că sunt incluse în Cadrele Naţionale ale Calificărilor

source: If you are enrolled on a programme leading to a FETAC or HETAC award, your award will now be made by Quality and Qualifications Ireland
ro: IUQB a fost responsabil pentru asigurarea calităţii în sectorul universitar irlandez. Conduce în mod regulat revizuiri ale procedurilor de calitate în universităţilor irlandeze

source: All providers of education and training need to inform learners of the transfer and progression routes that are available for them if they undertake a particular course
ro: Toţi furnizorii de educaţie şi pregătire trebuie să informeze elevii/studenţii cu privire la posibilităţile de transfer şi progres care le sunt disponibile în cazul în care încep un anumit curs

source: Individual learners may also approach QQI directly to seek certification or recognition for their existing knowledge, skill or competence
ro: Elevii individuali trebuie să abordeze direct QQI pentru a căuta certificarea sau recunoaşterea cunoştinţelor existente,a abilităţilor sau a competenţelor

source: It will be a matter for QQI to decide how this prior learning and prior experience can be assessed and they may look for help and advice from the providers of education and training in making this assessment
ro: QQI va decide cum cunoştinţele anterioare şi experienţa anterioară pot fi evaluate şi pot cere ajutorul furnizorilor de educaţie şi instruire în obţinerea unei evaluări

source: There are specific provisions for the protection of learners where a provider operates programmes of education and training on a commercial and profit-making basis
ro: Există prevederi speciale în ceea ce priveşte protecţia elevilor sau studenţilor în cazul în care un furnizor oferă programe educaţionale şi de pregătire cu scop comercial şi în vederea realizării unui profit

source: Such programmes will not be recognised by QQI unless there are provisions in place to ensure that the provider can provide an alternative place in another institution, or has a reserve fund or is adequately insured
ro: Astfel de programe nu vor fi recunoscute de QQi decât dacă există prevederi în vigoare pentru a asigura că furnizorul poate oferi un loc alternativ într-o altă instituţie, sau are un fond de rezervă sau este asigurat în mod adecvat
